starter-kit-othermode.org
#+TITLE: Starter Kit Other Mode
#+OPTIONS: toc:nil num:nil ^:nil

This is part of the [[file:starter-kit.org][Emacs Starter Kit]].

* Starter Kit Other Mode
** Coding Hook
#+BEGIN_SRC emacs-lisp
  (add-hook 'emacs-lisp-mode-hook 'run-starter-kit-coding-hook)
  (add-hook 'sh-mode-hook         'run-starter-kit-coding-hook)
  (add-hook 'latex-mode-hook      'run-starter-kit-coding-hook)
  (add-hook 'python-mode-hook     'run-starter-kit-coding-hook)
#+END_SRC

** latex-mode
#+BEGIN_SRC emacs-lisp
  (add-hook 'latex-mode-hook 'turn-on-orgtbl)
  ;;(add-hook 'latex-mode-hook 'turn-on-auto-fill)
#+END_SRC

** cmake-mode
#+BEGIN_SRC emacs-lisp
  (require 'cmake-mode)
   (setq auto-mode-alist
         (append '(("CMakeLists\\.txt\\'" . cmake-mode)
                   ("\\.cmake\\'" . cmake-mode))
                 auto-mode-alist))
#+END_SRC

** multi-web-mode
#+BEGIN_SRC emacs-lisp
  (require 'multi-web-mode)
  (setq mweb-default-major-mode 'html-mode)
  (setq mweb-tags '((php-mode "<\\?php\\|<\\? \\|<\\?=" "\\?>")
                    (js-mode "<script +\\(type=\"text/javascript\"\\|language=\"javascript\"\\)[^>]*>" "</script>")
                    (css-mode "<style +type=\"text/css\"[^>]*>" "</style>")))
  (setq mweb-filename-extensions '("php" "htm" "html" "ctp" "phtml" "php4" "php5"))
  (multi-web-global-mode 1)
#+END_SRC

** css-mode
#+BEGIN_SRC emacs-lisp
  (defvar hexcolour-keywords
    '(("#[abcdef[:digit:]]\\{6\\}"
       (0 (put-text-property
           (match-beginning 0)
           (match-end 0)
           'face (list :background
                       (match-string-no-properties 0)))))))
  (defun hexcolour-add-to-font-lock ()
    (font-lock-add-keywords nil hexcolour-keywords))

  (add-hook 'css-mode-hook 'hexcolour-add-to-font-lock)
#+END_SRC

** trac-wiki-mode
Define some usual =trac-wiki= projects.
#+BEGIN_SRC emacs-lisp
  (require 'trac-wiki)
  (trac-wiki-define-project "trac-LAL"
                            "https://trac.lal.in2p3.fr/NEMO2/" t)

  (trac-wiki-define-project "trac-LPC"
                            "https://nemo.lpc-caen.in2p3.fr/" t)

  (autoload 'trac-wiki "trac-wiki"
    "Trac wiki editing entry-point." t)
#+END_SRC
